testing-monitoring-design/load-tests/load-test-render.yml
config:
  target: 'https://your-app-name.onrender.com'
  phases:
    # Warm-up phase - gentle start
    - duration: 30
      arrivalRate: 2
      name: "Warm-up"
    
    # Ramp-up phase - gradually increase load
    - duration: 60
      arrivalRate: 2
      rampTo: 20
      name: "Ramp-up"
    
    # Sustained load phase - test normal operation
    - duration: 120
      arrivalRate: 20
      name: "Sustained load"
    
    # Peak load phase - test limits
    - duration: 60
      arrivalRate: 20
      rampTo: 50
      name: "Peak load"
    
    # Stress test phase - push beyond normal limits
    - duration: 90
      arrivalRate: 50
      rampTo: 100
      name: "Stress test"
    
    # Cool-down phase - return to normal
    - duration: 30
      arrivalRate: 100
      rampTo: 5
      name: "Cool-down"
  
  # Global headers
  headers:
    Content-Type: 'application/json'
    User-Agent: 'ICLR-Rating-LoadTest/1.0'
  
  # Environment variables
  variables:
    baseUrl: 'https://your-app-name.onrender.com'
    authToken: ''
    userId: ''
    paperId: ''
  
  # Plugins
  plugins:
    metrics-by-endpoint: {}
    expect: {}
    metrics-by-endpoint: {}
  
  # Performance thresholds
  ensure:
    maxErrorRate: 10  # Allow higher error rate for Render (cold starts)
    maxResponseTime: 5000  # 5 seconds max for Render
    p95: 3000  # 95% of requests should complete within 3 seconds

# Test scenarios
scenarios:
  # Health check - simple endpoint test
  - name: "Health Check"
    weight: 15
    flow:
      - get:
          url: "/api/iclr/random"
          expect:
            - statusCode: 200
            - contentType: json
            - maxResponseTime: 3000
          capture:
            - json: "$.data[0]._id"
              as: "paperId"
    
  # Paper retrieval scenarios
  - name: "Paper Retrieval"
    weight: 25
    flow:
      - get:
          url: "/api/iclr"
          expect:
            - statusCode: 200
            - contentType: json
            - maxResponseTime: 5000
      
      - get:
          url: "/api/iclr/paginated?limit=10&skip=0"
          expect:
            - statusCode: 200
            - contentType: json
            - maxResponseTime: 3000
      
      - get:
          url: "/api/iclr/ranking/likes/10"
          expect:
            - statusCode: 200
            - contentType: json
            - maxResponseTime: 4000
  
  # Search operations
  - name: "Search Operations"
    weight: 20
    flow:
      - get:
          url: "/api/iclr/author/machine"
          expect:
            - statusCode: 200
            - contentType: json
            - maxResponseTime: 4000
      
      - get:
          url: "/api/iclr/decision/accept"
          expect:
            - statusCode: 200
            - contentType: json
            - maxResponseTime: 3000
  
  # Prediction system - heavier operations
  - name: "Prediction System"
    weight: 20
    flow:
      - post:
          url: "/api/prompt/all_predictions_by_prompt"
          json:
            prompt: "Given the following reviews, determine if a paper would be accepted."
          expect:
            - statusCode: 200
            - contentType: json
            - maxResponseTime: 8000  # Allow more time for AI predictions
  
  # Mixed operations - simulate real user behavior
  - name: "Mixed Operations"
    weight: 20
    flow:
      - get:
          url: "/api/iclr/random"
          expect:
            - statusCode: 200
            - maxResponseTime: 3000
      
      - think: 1  # Simulate user thinking time
      
      - get:
          url: "/api/iclr/ranking/likes/5"
          expect:
            - statusCode: 200
            - maxResponseTime: 3000
      
      - think: 2
      
      - post:
          url: "/api/prompt/all_predictions_by_prompt"
          json:
            prompt: "Will this paper be accepted?"
          expect:
            - statusCode: 200
            - maxResponseTime: 8000

# Performance thresholds for Render
ensure:
  # Error rate should be less than 10% (higher tolerance for Render)
  maxErrorRate: 10
  
  # 95% of requests should complete within 3 seconds
  p95: 3000
  
  # 99% of requests should complete within 8 seconds
  p99: 8000
  
  # Average response time should be less than 2 seconds
  maxResponseTime: 2000

# Custom metrics
metrics:
  # Track response times by endpoint
  responseTime:
    - name: "GET /api/iclr/random"
      threshold: 3000
    - name: "GET /api/iclr/paginated"
      threshold: 3000
    - name: "GET /api/iclr/ranking/likes"
      threshold: 4000
    - name: "POST /api/prompt/all_predictions_by_prompt"
      threshold: 8000
  
  # Track error rates
  errorRate:
    - name: "Overall Error Rate"
      threshold: 10
  
  # Track throughput
  throughput:
    - name: "Requests per second"
      threshold: 20

# Reporting configuration
reporting:
  # Generate detailed reports
  detailed: true
  
  # Include response time percentiles
  percentiles: [50, 75, 90, 95, 99]
  
  # Include error breakdown
  errors: true
  
  # Include custom metrics
  custom: true
  
  # Output format
  output: "load-test-render-results.json"